InformationRegisters/ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзмененийМСФО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзмененийНДС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛогированиеИзмененийРегистраГраницЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЛогированиеИзмененийРегистраГраницЗапрета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильПолномочийПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПолномочийПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоУпаковке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотрВсехМагазиновВНовойВкусвилл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АК_ВнутренийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСотрудниковАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьЗаданияПоЗаявкамНаРасходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноУдалениеТоварныхОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодчиненныеПользователи</Name>
					<Comment>пока что это сделано для установки границ запрета, возможно потом расширится</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГраницыЗапретаИзмененияДанных/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	//+++АК POZM 2018.07.26 ИП-00019351
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбработанныеПользователи") = Ложь Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработанныеПользователи",Новый Соответствие);
	КонецЕсли;	
	Для каждого Запись Из ЭтотОбъект Цикл
	
		ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи.Вставить(Запись.Пользователь,Запись.Пользователь);
	
	КонецЦикла; 
	//---АК POZM 	
	//запишем в лог
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("БылаОчистка") = Ложь
		И ЭтотОбъект.Количество() = 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		ОтборОрганизация = ЭтотОбъект.Отбор.Найти("Организация");
		ОтборПользователь = ЭтотОбъект.Отбор.Найти("Пользователь");
		Если ОтборОрганизация <> Неопределено
			ИЛИ ОтборПользователь <> Неопределено Тогда
			Если ОтборОрганизация <> Неопределено Тогда
				Набор.Отбор.Организация.Установить(ОтборОрганизация.Значение);
			КонецЕсли;
			Если ОтборПользователь <> Неопределено Тогда
				Набор.Отбор.Пользователь.Установить(ОтборПользователь.Значение);
			КонецЕсли;
			Набор.Прочитать();
			//+++АК POZM 2018.08.01 ИП-00019351
			Для каждого Запись Из Набор Цикл
	
				ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи.Вставить(Запись.Пользователь,Запись.Пользователь);
			
			КонецЦикла; 
			
			Набор.ДополнительныеСвойства.Вставить("ОбработанныеПользователи",ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи);
			//---АК POZM 
			Для Каждого ЗаписьСерт Из Набор Цикл
				Запись = РегистрыСведений.ЛогированиеИзмененийРегистраГраницЗапрета.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, ЗаписьСерт);
				Запись.Период = ТекущаяДата();
				Запись.Тип = 0;
				Запись.Действие = "Удалена запись";
				Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				Запись.Записать();
				
				ЗапросПодчиненных = Новый Запрос();
				ЗапросПодчиненных.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
				ЗапросПодчиненных.Текст = "ВЫБРАТЬ
				                          |	ГраницыЗапретаИзмененияДанных.Пользователь
				                          |ИЗ
				                          |	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
				                          |ГДЕ
				                          |	ГраницыЗапретаИзмененияДанных.Пользователь В
				                          |			(ВЫБРАТЬ
				                          |				ПользователиПодчиненныеПользователи.Пользователь
				                          |			ИЗ
				                          |				Справочник.Пользователи.ПодчиненныеПользователи КАК ПользователиПодчиненныеПользователи
				                          |			ГДЕ
				                          |				ПользователиПодчиненныеПользователи.Ссылка = &Ссылка И ПользователиПодчиненныеПользователи.Ссылка <> &ТекПользователь)";
										  
				ЗапросПодчиненных.УстановитьПараметр("Ссылка", ЗаписьСерт.Пользователь);
				Выборка = ЗапросПодчиненных.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					//+++АК POZM 2018.08.01 ИП-00019333 
					Если ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи.Получить(Выборка.Пользователь)<> Неопределено Тогда
						Продолжить;
					Иначе
						ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи.Вставить(Выборка.Пользователь,Выборка.Пользователь);
					КонецЕсли;	
					//---АК POZM 
					Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
					Набор.Отбор.Пользователь.Установить(Выборка.Пользователь);
					//+++АК POZM 2018.08.01 ИП-00019333 
					Набор.ДополнительныеСвойства.Вставить("ОбработанныеПользователи",ЭтотОбъект.ДополнительныеСвойства.ОбработанныеПользователи);
					//---АК POZM 
					Набор.Записать();
				КонецЦикла;	
				
			КонецЦикла;	
			ЭтотОбъект.ДополнительныеСвойства.Вставить("БылаОчистка", Истина);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("БылаОчистка") = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого ЗаписьСерт Из ЭтотОбъект Цикл
			Запись = РегистрыСведений.ЛогированиеИзмененийРегистраГраницЗапрета.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьСерт);
			Запись.Период = ТекущаяДата();
			Запись.Тип = 1;
			Запись.Действие = "Добавлена запись";
			Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Запись.Записать();
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.ГраницаЗапретаИзмененийНДС) 
			И ЗначениеЗаполнено(Запись.ГраницаЗапретаИзменений) 
			И Запись.ГраницаЗапретаИзменений < Запись.ГраницаЗапретаИзмененийНДС Тогда
			#Если Клиент Тогда
				Сообщить("Граница запрета изменений НДС не может быть больше границы запрета изменений");			
			#КонецЕсли
			Отказ = Истина;
			
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
